package com.javarush.test.level03.lesson04.task05;

/* Сумма 10 чисел
Вывести на экран сумму чисел от 1 до 10 построчно (должно быть 10 строк):
1
1+2=3
1+2+3=6
1+2+3+4=10
...
Пример вывода:
1
3
6
10
...
*/

public class Solution
{
    public static void main(String[] args)
    {
        System.out.println(1);//напишите тут ваш код
        System.out.println(1+2);//напишите тут ваш код
        System.out.println(1+2+3);//напишите тут ваш код
        System.out.println(1+2+3+4);//напишите тут ваш код
        System.out.println(1+2+3+4+5);//напишите тут ваш код
        System.out.println(1+2+3+4+5+6);//напишите тут ваш код
        System.out.println(1+2+3+4+5+6+7);//напишите тут ваш код
        System.out.println(1+2+3+4+5+6+7+8);//напишите тут ваш код
        System.out.println(1+2+3+4+5+6+7+8+9);//напишите тут ваш код
        System.out.println(1+2+3+4+5+6+7+8+9+10);//напишите тут ваш код

    }
}